Revit 2027 API
ParameterTypeId.AnalyticalModelCodeChecking Property
 "Code Checking": Used for Analytical wall, Analytical beam, Analytical column, Analytical floor, Analytical wall foundations, Analytical isolated foundations, Analytical foundations slab, Anaytical brace
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalModelCodeChecking { get; }
Public Shared ReadOnly Property AnalyticalModelCodeChecking As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalModelCodeChecking {
	ForgeTypeId^ get ();
}
static member AnalyticalModelCodeChecking : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace